---
kind: property
id: P:Autodesk.Revit.DB.NurbsSurfaceData.DegreeV
source: html/7bc890a0-c3d3-8e7f-5d9d-148a69de4813.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.DegreeV Property

The degree of the spline in the v-direction.

## Syntax (C#)
```csharp
public int DegreeV { get; }
```